#!/usr/bin/python3.8

from platform import system
import os

os.chdir(os.path.dirname(__file__))
os.chdir("..")
instagram_bot_folder_location = os.getcwd()


if (system() == "Linux") or (system() == "Darwin"):
    error_txt_file_address = instagram_bot_folder_location + "/error/"

elif system() == "Windows":
    error_txt_file_address = instagram_bot_folder_location + "\\error\\"



CHOOSING_USERNAME, GETTING_USERNAME, CHOOSING_PASSWORD, GETTING_PASSWORD, START_BUTTON, BUTTON_HANDLER = range(0, 6)


admin_chat_id                    = 459185918


my_bot_token                     = '966866956:AAHafludOO9bviefKtMSkY8tNr2yMIgDnX4'


username_button_message          = """خب حالا میتونید با زدن دکمه 'نام کاربری' یوزر اینستاگرام خود را وارد کنید"""


input_username_message           = "نام کاربری خود را وارد کنید:"


input_password_message           = "پسورد خود را وارد کنید:"


password_button_message          = "روی گزینه رمز عبور کلیک کنید در صورتی که فک می کنید نام کاربری خود را اشتباه وارد کردید روی دکمه مرحله قبل کلیک کنید"


start_button_message             = "روی گزینه شروع فعالیت کلیک کنید در صورتی که فک می کنید نام کاربری و یا پسورد یا هردو را اشتباه وارد کردید روی دکمه مرحله قبل کلیک کنید"


waiting_message                  = "من منتظرم که شما یه گزینه ای رو انتخاب کنید"


choose_option_message            = "بین گزینه های زیر انتخاب کنید:"


start_activity_message           = "حله در حال حاضر می تونم فقط این چندتا قابلیت رو در اختیارتون بزارم البته بعدها با توجه به نظر شما کاربرا بیشتر میشن حالا با توجه به نکاتی که گفتم روی چیزی که میخوای کلیک کن و اگه همچنان فکر میکنی که نام کاربری و پسوردت رو اشتباه زدی روی دکمه شروع دوباره بزن تا همه چی از سر گرفته بشه"


warning_to_click_unfollow_button = """شما در ابتدای فعالیت خود نمیتوانید از قابلیت آنفالو استفاده کنید ابتدا شروع به فعالیت با گزینه های فالو یا حالت خودکار و سپس تکمیل فرایند خود کنید و یا می توانید به صورت دستی با زدن روی آخرین گزینه ربات لینک کسایی که شمارا آنفالو کردند به دست بیاورید و خودتان شروع به آنفالو کنید"""

warning_to_unfollow_persons      = """تذکر:\n۱- اگر می خواهید امروز فقط آنفالو انجام دهید سعی کنید بین 7 تا 10 آنفالو در ساعت انجام دهید\n۲- اگر می خواهید امروز فعالیت های دیگر هم علاوه بر آنفالو داشته باشید کمتر از 100 نفر آنفالو کنید و بقیه کار رو با انتخاب یک گزینه ی دیگه به ربات بسپارید"""


login_error_message              = "مثل اینکه شما در هنگام ورود به اکانت خود به مشکل خوردید گزینه های زیر را چک کنید:\n\n۱- چک کنید که پسورد و نام کاربری شما حتما درست باشد\n\n۲- اتصال خود را به اینترنت بررسی کنید\n\n۳- اگر با صفحه احراز هویت اینستاگرام رو به رو شدید باید هویت خود را دستی تایید کنید و بعد ربات را اجرا کنید\n\n۴- در صورتی که این گزینه ها را چک کردید و هیچ کدام از آنها مشکل شما را برطرف نکرد به یوزر سازنده ربات که در بایو قرار دارد پیام دهید تا مشکل بررسی شود"


start_command_message             = """سلام به اولترانگرام خوش اومدید قبل از شروع فعالیتتون بهتره که نکاتی رو خدمتتون عرض کنم و حتما همه نکات گفته شده رو با دقت مطالعه کنید:\n\n۱-  این ربات تازه درست شده پس خواهشی که دارم اینه که انتظاراتتون رو مقداری اگه میشه پایین بیارید و حمایت کنید این ربات رو تا در راستای بهتر شدن ربات به شما کاربرای عزیر کمک کنم\n\n۲-  حواستون باشه که من بین بعضی فعالیت ها 24 ساعت وقفه قرار دادم پس اگه میخواین فعالیتی انجام بدین نوع فعالیت خودتون رو بین گزینه ها با احتیاط انتخاب کنید چون بعدش تا 24 ساعت بعد به بعضی فعالیت ها دسترسی ندارین در واقع فقط در روز می توانید از یک قابلیت ربات استفاده کنید این محدودیت و محدودیت های دیگه ربات در اجرا فقط بخاطر وجود محدودیت های اینستاگرام و رصد شدن فعالیت های ربات گونه توسط الگوریتم های اینستاگرام هستش و سعی شده که با این محدودیت ها از بلاک شدن اکانت شما و تشخیص فعالیت های ربات گونه توسط اینستاگرام جلوگیری بشه\n\n۳-  اگه با ربات مشکلی داشتین از طریق یوزری که در بایو ربات قرار دادم می تونید مشکل رو به من اطلاع رسانی کنید تا حلش کنم\n\n۴-  با زدن روی دکمه شروع دوباره می توانید فعالیت خود را از سر بگیرید\n\n۵-  متاسفانه ربات رو فقط روی کامپیوتر یا لپ تاپ می تونید اجرا کنید و امکان اجرا روی گوشی در حال حاضر وجود نداره\n\n۶-  توی لپ تاپ یا کامپیوتر شما برای اجرای ربات نیاز به مرورگر دارید و پیشنهاد میشه که حتما از مرورگر موزیلا یا همون فایرفاکس استفاده کنید\n\n۷-  در اخرم که مخلص همه کاربرای جدید هستم و به خصوص کسایی که قراره حمایت کنن این ربات رو و امیدوارم که بتونم توجه و اطمینان شما کاربرای عزیز و دوست داشتنی رو به این ربات جلب کنم"""


runtime_error_message             = """به دلایلی انگار که ربات متوقف شده و مثل اینکه در اجرای دستور شما به مشکل خورده با زدن گزینه شروع دوباره فرایند اجرای فعالیت را از سر بگیرید و اگر با چند بار اجرا کردن مشکل برطرف نشد این مشکل رو به سازنده من گزارش بدید"""


error_message_to_execute_command  = "من نمی تونم توی این مرحله یک دستور به طور مثال /start رو اجرا کنم"


connection_error_message          = 'به دلیل قطع شدن اتصال شما به اینترنت در هنگام ورود به اکانتتون فعالیت مورد نظر لغو شد می توانید دوباره فعالیت خود را آغاز کنید'


successfully_message              = "عملیات شما با موفقیت انجام شد"


close_driver_error_message        = "لطفا در در هنگام اجرای ربات مرورگر را نبندید (روی ضربدر پنجره مرورگر کلیک نکنید) و بزارید ربات رو حالت اجرا بماند"


error_message_for_browers         = "شما باید مرورگر فایرفاکس را اول نصب کنید"


error_message_for_oprating_system = "سیستم عامل شما مورد قبول نیست"





def get24HourMessage(last_run_time, passed_time):
    message = f"باید از آخرین فعالیت شما 24 بگذرد آخرین فعالیت شما در ساعت {last_run_time} ثبت شده است و زمان گذشته شده از آخرین فعالیت شما {passed_time} می باشد\n\nنکته:\nدقت کنید که اگر می خواهید از قابلیت آنفالو استفاده کنید باید بین هر بار استفاده از این  قابلیت 7 روز یا بیشتر و نسبت به قابلیت های دیگر هم 1 روز یا بیشتر فاصله وجود داشته باشد"
    return message

def get7dayMessage(last_run_time, passed_time_in_day, passed_time_in_hour):
    massage = f"""باید از اخرین زمان استفاده شما از قابلیت آنفالو 7 روز یا بیشتر و نسبت به قابلیت های دیگر 1 روز یا بیشتر بگذرد اخرین زمان استفاده شما از قابلیت آنفالو در ساعت {last_run_time} می باشد زمان گذشته از اخرین فعالیت شما {passed_time_in_day} روز و {passed_time_in_hour} است\n"""
    return massage






